---
kind: method
id: M:Autodesk.Revit.DB.ConnectorElement.FlipDirection
source: html/7990bca8-ff59-0bac-572f-0c32929e5221.htm
---
# Autodesk.Revit.DB.ConnectorElement.FlipDirection Method

Reverses the direction of the connector element.

## Syntax (C#)
```csharp
public void FlipDirection()
```